app/views/restaurantes/show.html.erb

<b>Nota média: </b>
  <%= @restaurante.qualificacoes.average(:nota) %><br/>
<b>Qualificações: </b>
  <%= @restaurante.qualificacoes.count %><br/>
<b>Preço médio: </b>
  <%= @restaurante.qualificacoes.average(:valor_gasto) %><br/><br/>
---
SELECT AVG("qualificacoes"."nota") AS avg_id FROM "qualificacoes" WHERE "qualificacoes"."restaurante_id" = $1  [["restaurante_id", 4]]
SELECT COUNT(*) FROM "qualificacoes" WHERE "qualificacoes"."restaurante_id" = $1  [["restaurante_id", 4]]
SELECT AVG("qualificacoes"."valor_gasto") AS avg_id FROM "qualificacoes" WHERE "qualificacoes"."restaurante_id" = $1  [["restaurante_id", 4]]