app/controllers/clientes_controller.rb

  def index
    @clientes = Cliente.all
---
SELECT "clientes".* FROM "clientes"

  def show
    @cliente = Cliente.find(params[:id])
---
SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save
---
INSERT INTO "clientes" ("created_at", "idade", "nome", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Thu, 20 Jul 2017 15:51:07 UTC +00:00], ["idade", 44], ["nome", "Cristiane"], ["updated_at", Thu, 20 Jul 2017 15:51:07 UTC +00:00]]

  def update
    respond_to do |format|
      if @cliente.update(cliente_params)
---
UPDATE "clientes" SET "nome" = $1, "updated_at" = $2 WHERE "clientes"."id" = 1  [["nome", "Cristiane Ribeiro"], ["updated_at", Thu, 20 Jul 2017 15:51:40 UTC +00:00]]

    def set_cliente
      @cliente = Cliente.find(params[:id])
---
SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT 1  [["id", "1"]]