app/controllers/qualificacoes_controller.rb

SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT 1  [["id", "4"]]
---
  def new
    #@clientes = Cliente.order :nome
    #@restaurantes = Restaurantes.order :nome
    preparar_form
    @qualificacao = Qualificacao.new

    if params[:cliente]
      @qualificacao.cliente = Cliente.find(params[:cliente])
    end

    if params[:restaurante]
      @qualificacao.restaurante = Restaurante.find(params[:restaurante])