app/controllers/restaurantes_controller.rb

SELECT "restaurantes".* FROM "restaurantes" ORDER BY "restaurantes".nome ASC
---
    def index # exibe todos os itens
        @restaurantes = Restaurante.all.order :id

SELECT "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT 1  [["id", "3"]]
---
    def show # exibe um item específico
        @restaurante = Restaurante.find(params[:id])

SELECT "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT 1  [["id", "19"]]
DELETE FROM "restaurantes" WHERE "restaurantes"."id" = $1  [["id", 19]]
---
    def destroy # remove um item existente
        @restaurante = Restaurante.find(params[:id])
        @restaurante.destroy

INSERT INTO "restaurantes" ("created_at", "endereco", "especialidade", "nome", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Tue, 18 Jul 2017 15:21:14 UTC +00:00], ["endereco", "Rua 50"], ["especialidade", "japonês"], ["nome", "Restaurante 50"], ["updated_at", Tue, 18 Jul 2017 15:21:14 UTC +00:00]]
---
    def create  # cria um novo item
        @restaurante = Restaurante.new(restaurante_params)
        if @restaurante.save

SELECT "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT 1  [["id", "id-do-restaurante"]]
---
    def edit # formumlário para edição de um item
        @restaurante = Restaurante.find(params[:id])

SELECT "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT 1  [["id", "11"]]
UPDATE "restaurantes" SET "endereco" = $1, "especialidade" = $2, "updated_at" = $3 WHERE "restaurantes"."id" = 1  [["endereco", "teste2"], ["especialidade", "teste2"], ["updated_at", Mon, 20 Nov 2017 20:44:00 UTC +00:00]]
---
    def update # atualiza um item existente
        @restaurante = Restaurante.find(params[:id])
        if @restaurante.update_attributes(restaurante_params)